app/Models/ModelKategori.php

    public function getKategoriOptions()
    {
        return $this->db->table('kategori_surat')->get()->getResultArray();
---
SELECT *
FROM `kategori_surat`