app/Models/PermohonanSuratModel.php

    public function getJumlahStatusByKategori($kategoriId, $status)
    {
        return $this->where('id_kategori_surat', $kategoriId)
            ->where('status', $status) // Gunakan nilai ENUM yang benar
            ->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `permohonan_surat`
WHERE `id_kategori_surat` = '1'
AND `status` = 'pending'