app/Models/WarisanModel.php

SELECT COUNT(*) AS `numrows`
FROM `ahli_waris`
WHERE `id_kategori_surat` = '1'
AND `status` = 'pending'
---
    public function getJumlahStatusByKategori($kategoriId, $status)
    {
        return $this->where('id_kategori_surat', $kategoriId)
            ->where('status', $status)
            ->countAllResults();

SELECT *
FROM `ahli_waris`
WHERE `status` = 'pending'
---
    public function getPendingData()
    {
        return $this->where('status', 'pending')->findAll();

SELECT *
FROM `ahli_waris`
WHERE `status` = 'disetujui'
---
    public function getApprovedData()
    {
        return $this->where('status', 'disetujui')->findAll();